ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0h321x/FLASHCTL_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="FLASHCTL" HW_revision="1.0">
    <register id="FLASHCTL_IIDX" width="32" offset="0x1020" description="Interrupt Index Register">
        <bitfield id="STAT" description="Indicates which interrupt has fired. 0x0 means no event pending. The priority order is fixed. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flags in the RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register must be updated with the next highest priority interrupt." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO_INTR" value="0x0" description="No Interrupt Pending"/>
            <bitenum id="DONE" value="0x1" description="DONE Interrupt Pending"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_IMASK" width="32" offset="0x1028" description="Interrupt Mask Register">
        <bitfield id="DONE" description="Interrupt mask for DONE:
0: Interrupt is disabled in MIS register
1: Interrupt is enabled in MIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Interrupt is masked out"/>
            <bitenum id="ENABLED" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in [IPSTANDARD.MIS] will be set"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_RIS" width="32" offset="0x1030" description="Raw Interrupt Status Register">
        <bitfield id="DONE" description="Flash wrapper operation completed.
This interrupt bit is set by firmware or the corresponding bit in the ISET register.
It is cleared by the corresponding bit in in the ICLR register or reading the IIDX register when this interrupt is the highest priority." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
            <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_MIS" width="32" offset="0x1038" description="Masked Interrupt Status Register">
        <bitfield id="DONE" description="Flash wrapper operation completed.
This masked interrupt bit reflects the bitwise AND of the corresponding RIS and IMASK bits." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="Masked interrupt did not occur"/>
            <bitenum id="SET" value="0x1" description="Masked interrupt occurred"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_ISET" width="32" offset="0x1040" description="Interrupt Set Register">
        <bitfield id="DONE" description="0: No effect
1: Set the DONE interrupt in the RIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set [IPSTANDARD.RIS] bit"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_ICLR" width="32" offset="0x1048" description="Interrupt Clear Register">
        <bitfield id="DONE" description="0: No effect
1: Clear the DONE interrupt in the RIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear [IPSTANDARD.RIS] bit"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for peripheral event" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. Hardware must clear the RIS."/>
        </bitfield>
    </register>
    <register id="FLASHCTL_DESC" width="32" offset="0x10FC" description="Hardware Version Description Register">
        <bitfield id="MINREV" description="Minor Revision" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major Revision" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance number" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature set" begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module ID" begin="31" end="16" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDEXEC" width="32" offset="0x1100" description="Command Execute Register">
        <bitfield id="VAL" description="Command Execute value
Initiates execution of the command specified in the CMDTYPE register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOEXECUTE" value="0x0" description="Command will not execute or is not executing in flash wrapper"/>
            <bitenum id="EXECUTE" value="0x1" description="Command will execute or is executing in flash wrapper"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDTYPE" width="32" offset="0x1104" description="Command Type Register">
        <bitfield id="COMMAND" description="Command type" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="NOOP" value="0x0" description="No Operation"/>
            <bitenum id="PROGRAM" value="0x1" description="Program"/>
            <bitenum id="ERASE" value="0x2" description="Erase"/>
            <bitenum id="READVERIFY" value="0x3" description="ReadVerify - Perform a standalone ReadVerify operation."/>
            <bitenum id="MODECHANGE" value="0x4" description="Mode Change - Perform a mode change only, no other operation."/>
            <bitenum id="CLEARSTATUS" value="0x5" description="Clear Status - Clear status bits in FW_SMSTAT only."/>
            <bitenum id="BLANKVERIFY" value="0x6" description="Blank Verify - Check whether a flash word is in the erased state.
This command may only be used with CMDTYPE.SIZE = ONEWORD"/>
        </bitfield>
        <bitfield id="SIZE" description="Command size" begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="ONEWORD" value="0x0" description="Operate on 1 flash word"/>
            <bitenum id="TWOWORD" value="0x1" description="Operate on 2 flash words"/>
            <bitenum id="FOURWORD" value="0x2" description="Operate on 4 flash words"/>
            <bitenum id="EIGHTWORD" value="0x3" description="Operate on 8 flash words"/>
            <bitenum id="SECTOR" value="0x4" description="Operate on a flash sector"/>
            <bitenum id="BANK" value="0x5" description="Operate on an entire flash bank"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDCTL" width="32" offset="0x1108" description="Command Control Register">
        <bitfield id="MODESEL" description="Mode
This field is only used for the Mode Change command type.  Otherwise, bank
and pump modes are set automaticlly through the NW hardware." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="READ" value="0x0" description="Read Mode"/>
            <bitenum id="RDMARG0" value="0x2" description="Read Margin 0 Mode"/>
            <bitenum id="RDMARG1" value="0x4" description="Read Margin 1 Mode"/>
            <bitenum id="RDMARG0B" value="0x6" description="Read Margin 0B Mode"/>
            <bitenum id="RDMARG1B" value="0x7" description="Read Margin 1B Mode"/>
            <bitenum id="PGMVER" value="0x9" description="Program Verify Mode"/>
            <bitenum id="PGMSW" value="0xA" description="Program Single Word"/>
            <bitenum id="ERASEVER" value="0xB" description="Erase Verify Mode"/>
            <bitenum id="ERASESECT" value="0xC" description="Erase Sector"/>
            <bitenum id="PGMMW" value="0xE" description="Program Multiple Word"/>
            <bitenum id="ERASEBNK" value="0xF" description="Erase Bank"/>
        </bitfield>
        <bitfield id="REGIONSEL" description="Bank Region
A specific region ID can be written to this field to indicate to which region an 
operation is to be applied if CMDCTL.ADDRXLATEOVR is set." begin="12" end="9" width="4" rwaccess="R/W">
            <bitenum id="MAIN" value="0x1" description="Main Region"/>
            <bitenum id="NONMAIN" value="0x2" description="Non-Main Region"/>
            <bitenum id="TRIM" value="0x4" description="Trim Region"/>
            <bitenum id="ENGR" value="0x8" description="Engr Region"/>
        </bitfield>
        <bitfield id="ADDRXLATEOVR" description="Override hardware address translation of address in CMDADDR from a 
system address to a bank address and bank ID.  Use data written to 
CMDADDR directly as the bank address.  Use the value written to 
CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
CMDCTL.REGIONSEL directly as the region ID." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NOOVERRIDE" value="0x0" description="Do not override"/>
            <bitenum id="OVERRIDE" value="0x1" description="Override"/>
        </bitfield>
        <bitfield id="SSERASEDIS" description="Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will be used
for all erase pulses.
By default, this bit is reset, meaning that the VHV voltage will be stepped during
successive erase pulses.  The step count, step voltage, begin and end voltages
are all hard-wired." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x0" description="Enable"/>
            <bitenum id="DISABLE" value="0x1" description="Disable"/>
        </bitfield>
        <bitfield id="DATAVEREN" description="Enable invalid data verify.  
This checks for 0-&gt;1 transitions in the memory when
a program operation is initiated.  If such a transition is found, the program will
fail with an error without executing the program." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDADDR" width="32" offset="0x1120" description="Command Address Register">
        <bitfield id="VAL" description="Address value" begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDBYTEN" width="32" offset="0x1124" description="Command Program Byte Enable Register">
        <bitfield id="VAL" description="Command Byte Enable value.
A 1-bit per flash word byte value is placed in this register." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0x3FFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA0" width="32" offset="0x1130" description="Command Data Register 0">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA1" width="32" offset="0x1134" description="Command Data Register 1">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTA" width="32" offset="0x11D0" description="Command Write Erase Protect A Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
